In [4]:
import pandas as pd
import numpy as np

In [5]:
# Pandas has two data types, dataframe and series

In [9]:
z = pd.DataFrame(data = np.random.randn(1000), index = pd.date_range('22-06-2020', periods = 1000))
y = pd.Series(data = np.random.randn(1000), index = pd.date_range('22-06-2020', periods = 1000))

In [11]:
z

                   0
2020-06-22  0.589275
2020-06-23 -0.747192
2020-06-24 -0.323826
2020-06-25  0.233619
2020-06-26 -0.176589
...              ...
2023-03-14  0.031691
2023-03-15 -1.699925
2023-03-16  0.031643
2023-03-17  0.428737
2023-03-18  0.352292

[1000 rows x 1 columns]

In [15]:
y

2020-06-22    1.777391
2020-06-23    0.284893
2020-06-24   -0.655111
2020-06-25    0.032169
2020-06-26   -1.227350
                ...
2023-03-14    1.098252
2023-03-15   -0.886429
2023-03-16   -1.198908
2023-03-17    1.193981
2023-03-18   -0.188463
Freq: D, Length: 1000, dtype: float64

In [13]:
type(z)

pandas.core.frame.DataFrame

In [14]:
type(y)

pandas.core.series.Series

In [60]:
arr1 = np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12]])
arr2 = np.array(['A','B','C'])
arr3 = np.array(['I','II','III','IV'])

In [61]:
arr1

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [62]:
ndtf = pd.DataFrame(arr1)

In [63]:
ndtf

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [64]:
ex = pd.DataFrame(data = arr1, index = arr2, columns = arr3 )

In [65]:
ex

   I  II  III  IV
A  1   2    3   4
B  5   6    7   8
C  9  10   11  12

# The combination of a dataframe and a string gives a series

In [74]:
ex

   I  II  III  IV
A  1   2    3   4
B  5   6    7   8
C  9  10   11  12

In [77]:
ex[0:2,]

   I  II  III  IV
A  1   2    3   4
B  5   6    7   8

In [82]:
s = 'python.hub'
print(s[::-1])

buh.nohtyp

In [87]:
ex['A':'C']

   I  II  III  IV
A  1   2    3   4
B  5   6    7   8
C  9  10   11  12

In [89]:
ex.loc['A']

I      1
II     2
III    3
IV     4
Name: A, dtype: int32

In [91]:
ex.loc['A'].transpose()

I      1
II     2
III    3
IV     4
Name: A, dtype: int32

In [96]:
ex.iloc[2]

I       9
II     10
III    11
IV     12
Name: C, dtype: int32

In [98]:
ex

   I  II  III  IV
A  1   2    3   4
B  5   6    7   8
C  9  10   11  12

In [101]:
ex['sales'] = ex['I']*ex['IV']

In [100]:
ex

   I  II  III  IV  sales
A  1   2    3   4      4
B  5   6    7   8     40
C  9  10   11  12    108

In [103]:
ex['ns'] = [1,2,3]

In [104]:
ex

   I  II  III  IV  sales  ns
A  1   2    3   4      4   1
B  5   6    7   8     40   2
C  9  10   11  12    108   3

In [115]:
ex.drop(['ns'],axis = 1)

   I  II  III  IV  sales
A  1   2    3   4      4
B  5   6    7   8     40
C  9  10   11  12    108

In [117]:
ex['sales'].mean()

50.666666666666664

In [123]:
ex.describe()

         I    II   III    IV       sales   ns
count  3.0   3.0   3.0   3.0    3.000000  3.0
mean   5.0   6.0   7.0   8.0   50.666667  2.0
std    4.0   4.0   4.0   4.0   52.814140  1.0
min    1.0   2.0   3.0   4.0    4.000000  1.0
25%    3.0   4.0   5.0   6.0   22.000000  1.5
50%    5.0   6.0   7.0   8.0   40.000000  2.0
75%    7.0   8.0   9.0  10.0   74.000000  2.5
max    9.0  10.0  11.0  12.0  108.000000  3.0

In [124]:
ex['sales'].describe()

count      3.000000
mean      50.666667
std       52.814140
min        4.000000
25%       22.000000
50%       40.000000
75%       74.000000
max      108.000000
Name: sales, dtype: float64